marcelobarrosalmeida/cc2538em/firmware/openos/bsp/boards/cc2538em/sens_itf/sens_itf_mote.c
#include "board.h"
#include "stdio.h"
#include <string.h>
#include "hw_ioc.h"             // Access to IOC register defines
#include "hw_ssi.h"             // Access to SSI register defines
#include "hw_sys_ctrl.h"        // Clocking control
#include "hw_memmap.h"
#include "ioc.h"                // Access to driverlib ioc fns
#include "gpio.h"               // Access to driverlib gpio fns
#include "openwsn.h"
#include "sens_itf.h"
#include "opentimers.h"
#include "scheduler.h"
#include "board.h"
#include "sys_ctrl.h"
#include "sens_itf_mote.h"
#include "opencoap.h"
#include "uarthal.h"
#include "leds.h"
#include "uart.h"
#include "packetfunctions.h"
#include "openqueue.h"

// minimum tick time is 1
#define MS2TICK(ms) (ms) > SENS_ITF_SM_TICK_MS ? (ms) / SENS_ITF_SM_TICK_MS : 1

enum {
    SENS_ITF_STATE_INIT = 0,
    SENS_ITF_STATE_SEND_ITF_VER = 1,
    SENS_ITF_STATE_WAIT_ITF_VER_ANS = 2,
    SENS_ITF_STATE_PROC_ITF_VER = 3,
    SENS_ITF_STATE_SEND_BRD_ID = 4,
    SENS_ITF_STATE_WAIT_BRD_ID_ANS = 5,
    SENS_ITF_STATE_PROC_BRD_ID = 6,
    SENS_ITF_STATE_SEND_PT_DESC = 7,
    SENS_ITF_STATE_WAIT_PT_DESC_ANS = 8,
    SENS_ITF_STATE_PROC_PT_DESC = 9,
    SENS_ITF_STATE_BUILD_SCH = 10,
    SENS_ITF_STATE_RUN_SCH = 11,
    SENS_ITF_STATE_SEND_PT_VAL = 12,
    SENS_ITF_STATE_WAIT_PT_VAL_ANS = 13,
    SENS_ITF_STATE_PROC_PT_VAL = 14
};

enum {
	SENS_ITF_STATE_EXEC_OK = 0,
	SENS_ITF_STATE_EXEC_WAIT_OK,
	SENS_ITF_STATE_EXEC_WAIT_STOP,
	SENS_ITF_STATE_EXEC_WAIT_ABORT,
	SENS_ITF_STATE_EXEC_ERROR
};

typedef struct sens_itf_mote_sm_state_s
{
	volatile uint16_t trmout_counter;
	volatile uint16_t trmout;
	volatile uint8_t point_index;
	volatile uint8_t frame_arrived;
	volatile uint8_t state;
	volatile uint8_t retries;
} sens_itf_mote_sm_state_t;

typedef uint8_t (*sens_itf_mote_sm_func_t)(sens_itf_mote_sm_state_t *st);

typedef struct sens_itf_mote_sm_table_s
{
	sens_itf_mote_sm_func_t func;
	uint8_t next_state;
	uint8_t abort_state; // for indicating timeout or end of cyclic operation
	uint8_t error_state;
} sens_itf_mote_sm_table_t;


typedef struct sens_itf_acq_schedule_s
{
	uint8_t num_of_points;
	struct
	{
		uint8_t index;
		uint32_t sampling_time_x250ms;
        uint32_t counter;
	} points[OSENS_MAX_POINTS];

	struct
	{
		uint8_t num_of_points;
		uint8_t index[OSENS_MAX_POINTS];
	} scan;
} sens_itf_acq_schedule_t;



static uint8_t sens_itf_mote_sm_func_build_sch(sens_itf_mote_sm_state_t *st);
static uint8_t sens_itf_mote_sm_func_pt_desc_ans(sens_itf_mote_sm_state_t *st);
static uint8_t sens_itf_mote_sm_func_req_pt_desc(sens_itf_mote_sm_state_t *st);
static uint8_t sens_itf_mote_sm_func_run_sch(sens_itf_mote_sm_state_t *st);

//=========================== variables =======================================

typedef struct {
   coap_resource_desc_t desc;
   opentimer_id_t  timerId;
} sensor_vars_t;

const uint8_t sensor_path0[]        = "h";

const sens_itf_mote_sm_table_t sens_itf_mote_sm_table[];

const uint8_t datatype_sizes[] = { 1, 1, 2, 2, 4, 4, 8, 8, 4, 8 }; // check sens_itf_datatypes_e order

sensor_vars_t sensor_vars;

uint8_t num_rx_bytes;
uint8_t tx_data_len;
uint32_t flagErrorOccurred;

uint8_t frame[SENS_ITF_MAX_FRAME_SIZE];

sens_itf_cmd_req_t cmd;
sens_itf_cmd_res_t ans;

sens_itf_mote_sm_state_t sm_state;
sens_itf_point_ctrl_t sensor_points;
osens_brd_id_t board_info;
sens_itf_acq_schedule_t acquisition_schedule;


//=========================== prototypes =======================================
//=========================== public ==========================================
uint8_t sensor_receive(OpenQueueEntry_t* msg, coap_header_iht*  coap_header, coap_option_iht* coap_options);
void sensor_timer(void);
static void sens_itf_mote_tick(void);
static void buBufFlush(void);
void bspLedToggle(uint8_t ui8Leds);
void sensor_sendDone(OpenQueueEntry_t* msg, owerror_t error);

uint8_t sens_itf_mote_init(void) {

#if (ENABLE_UART0_DAG == 0)
	memset(&sm_state, 0, sizeof(sens_itf_mote_sm_state_t));
	sm_state.state = SENS_ITF_STATE_INIT;

	//buBufFlush();
    opentimers_start(SENS_ITF_SM_TICK_MS, TIMER_PERIODIC, TIME_MS, (opentimers_cbt) sens_itf_mote_tick);


    // prepare the resource descriptor
/*

    sensor_vars.desc.path0len            = sizeof(sensor_path0)-1;
    sensor_vars.desc.path0val            = (uint8_t*)(&sensor_path0);
    sensor_vars.desc.path1len            = 0;
    sensor_vars.desc.path1val            = NULL;
    sensor_vars.desc.componentID         = COMPONENT_RHELI;    //MUDAR
    sensor_vars.desc.callbackRx          = &sensor_receive;
    sensor_vars.desc.callbackSendDone    = &sensor_sendDone;

    opencoap_register(&sensor_vars.desc);
    sensor_vars.timerId    = opentimers_start(1000,
                                             TIMER_PERIODIC,TIME_MS,
                                             sensor_timer);

*/
#endif

    return 0;
}

//=========================== private ==========================================

owerror_t sensor_receive(OpenQueueEntry_t* msg,
                      coap_header_iht*  coap_header,
                      coap_option_iht*  coap_options) {
   owerror_t outcome;
   uint8_t rawdata[127];

   if (coap_header->Code==COAP_CODE_REQ_POST)
   {
	   //TODO!!!! INCLUDE WRITE SENSOR HERE

      // start/stop the data generation to data server
      if (msg->payload[0]=='1')
      {
         //restart timer
        // opentimers_restart(rxl1_vars.timerId);

      } else {
         //stop timer
         //opentimers_stop(rxl1_vars.timerId);
      }

      // reset packet payload
      msg->payload                     = &(msg->packet[127]);
      msg->length                      = 0;

      // CoAP header
      coap_header->Code                = COAP_CODE_RESP_VALID;

      outcome = E_SUCCESS;

   }
   else if (coap_header->Code==COAP_CODE_REQ_GET)
   {
      // return current sensor value

      // reset packet payload
      msg->payload                     = &(msg->packet[127]);
      msg->length                      = 0;

