marcelobarrosalmeida/cc2538em/firmware/openos/bsp/boards/cc2538em/sens_itf/sens_itf_mote.c
      // CoAP payload (8 bytes of XL data)
      packetfunctions_reserveHeaderSize(msg,9);

      //sensitive_accel_temperature_get_measurement(&rawdata[0]);

      msg->payload[0] = COAP_PAYLOAD_MARKER;

      memcpy(&msg->payload[1],&rawdata[8],8);

      // set the CoAP header
      coap_header->Code                = COAP_CODE_RESP_CONTENT;

      outcome                          = E_SUCCESS;

   }
   else {
      // return an error message
      outcome = E_FAIL;
   }

   return outcome;
}

void sensor_timer() {
   OpenQueueEntry_t* pkt;
   owerror_t           outcome;
   uint8_t           numOptions;
   uint8_t           rawdata[127];


   // create a CoAP RD packet
   pkt = openqueue_getFreePacketBuffer(COMPONENT_RXL1);
   if (pkt==NULL) {
      openserial_printError(COMPONENT_RXL1,ERR_NO_FREE_PACKET_BUFFER,
                            (errorparameter_t)0,
                            (errorparameter_t)0);
      openqueue_freePacketBuffer(pkt);
      return;
   }
   // take ownership over that packet
   pkt->creator    = COMPONENT_RXL1;
   pkt->owner      = COMPONENT_RXL1;
   // CoAP payload (2 bytes of temperature data)
   packetfunctions_reserveHeaderSize(pkt,2);
   //sensitive_accel_temperature_get_measurement(&rawdata[0]);
   pkt->payload[0] = rawdata[8];
   pkt->payload[1] = rawdata[9];
   numOptions = 0;
   // location-path option
   packetfunctions_reserveHeaderSize(pkt,sizeof(sensor_path0)-1);
   memcpy(&pkt->payload[0],&sensor_path0,sizeof(sensor_path0)-1);
   packetfunctions_reserveHeaderSize(pkt,1);
   //pkt->payload[0]                  = ((COAP_OPTION_NUM_URIPATH << (4 | sizeof(sensor_path0)-1);
   numOptions++;
   // content-type option
   packetfunctions_reserveHeaderSize(pkt,2);
   //pkt->payload[0]                  = COAP_OPTION_NUM_CONTENTFORMAT << 4 | 1;
   pkt->payload[1]                  = COAP_MEDTYPE_APPOCTETSTREAM;
   numOptions++;
   // metadata
   pkt->l4_destination_port         = WKP_UDP_COAP;
   pkt->l3_destinationAdd.type = ADDR_128B;
   memcpy(&pkt->l3_destinationAdd.addr_128b[0],&ipAddr_motesEecs,16);
   // send
   outcome = opencoap_send(pkt,
                           COAP_TYPE_NON,
                           COAP_CODE_REQ_PUT,
                           numOptions,
                           &sensor_vars.desc);
   // avoid overflowing the queue if fails
   if (outcome==E_FAIL) {
      openqueue_freePacketBuffer(pkt);
   }


   return;
}

void sensor_sendDone(OpenQueueEntry_t* msg, owerror_t error) {
   openqueue_freePacketBuffer(msg);
}

static uint8_t sens_itf_mote_pack_send_frame(sens_itf_cmd_req_t *cmd, uint8_t cmd_size)
{
    uint8_t size;

    size = sens_itf_pack_cmd_req(cmd, frame);

    if (size != cmd_size)
        return SENS_ITF_STATE_EXEC_ERROR;

    if (sens_itf_mote_send_frame(frame, cmd_size) != cmd_size)
    	return SENS_ITF_STATE_EXEC_ERROR;

    return SENS_ITF_STATE_EXEC_OK;
}

static uint8_t sens_itf_mote_sm_func_pt_val_ans(sens_itf_mote_sm_state_t *st)
{
	uint8_t point,ui8Len;
	uint8_t size,ret;
    uint8_t ans_size;
    uint8_t *pui8Buf;
    uint32_t ui32Data;

    point = acquisition_schedule.scan.index[st->point_index];
    ans_size = 6 + datatype_sizes[sensor_points.points[point].desc.type];

    size = sens_itf_unpack_cmd_res(&ans, frame, ans_size);

    // retry ?
    if (size != ans_size || ans.hdr.addr != (SENS_ITF_REGMAP_READ_POINT_DATA_1 + point))
        return SENS_ITF_STATE_EXEC_OK;

    // ok, save and go to the next
    memcpy(&sensor_points.points[point].value, &ans.payload.point_value_cmd, sizeof(osens_point_t));

    st->retries = 0;
    st->point_index++;

	leds_debug_toggle();  //LED3

    return SENS_ITF_STATE_EXEC_OK;
}

static uint8_t sens_itf_mote_sm_func_req_pt_val(sens_itf_mote_sm_state_t *st)
{
    uint8_t point;

	// end of point reading
    if(st->point_index >= acquisition_schedule.scan.num_of_points)
    	return SENS_ITF_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
	st->retries++;
	if(st->retries > 3)
		return SENS_ITF_STATE_EXEC_ERROR;

	// normal point reading
	point = acquisition_schedule.scan.index[st->point_index];
    cmd.hdr.addr = SENS_ITF_REGMAP_READ_POINT_DATA_1 + point;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return sens_itf_mote_pack_send_frame(&cmd, 4);

}

static uint8_t sens_itf_mote_sm_func_run_sch(sens_itf_mote_sm_state_t *st)
{
    uint8_t n;

    acquisition_schedule.scan.num_of_points = 0;

    for (n = 0; n < acquisition_schedule.num_of_points; n++)
    {

    	if(acquisition_schedule.points[n].counter > 0)
    		acquisition_schedule.points[n].counter--;

        if (acquisition_schedule.points[n].counter == 0)
        {
        	acquisition_schedule.scan.index[acquisition_schedule.scan.num_of_points] = n;
        	acquisition_schedule.scan.num_of_points++;
        }

    }

    if(acquisition_schedule.scan.num_of_points > 0)
    {
    	st->point_index = 0;
    	st->retries = 0;
    	return SENS_ITF_STATE_EXEC_WAIT_ABORT;
    }
    else
    	return SENS_ITF_STATE_EXEC_WAIT_OK;
}

/*

{
    sens_itf_mote_read_point(acquisition_schedule.points[n].index);
    acquisition_schedule.points[n].counter = acquisition_schedule.points[n].sampling_time_x250ms;
}
*/

static uint8_t sens_itf_mote_sm_func_build_sch(sens_itf_mote_sm_state_t *st)
{
	uint8_t n, m;

    acquisition_schedule.num_of_points = 0;

    for (n = 0, m = 0; n < board_info.num_of_points; n++)
    {
        if ((sensor_points.points[n].desc.access_rights & OSENS_ACCESS_READ_ONLY) &&
            (sensor_points.points[n].desc.sampling_time_x250ms > 0))
        {
            acquisition_schedule.points[m].index = n;
            acquisition_schedule.points[m].counter = sensor_points.points[n].desc.sampling_time_x250ms;
            acquisition_schedule.points[m].sampling_time_x250ms = sensor_points.points[n].desc.sampling_time_x250ms;

            m++;
            acquisition_schedule.num_of_points++;
        }
    }

    return SENS_ITF_STATE_EXEC_OK;
}

