marcelobarrosalmeida/cc2538em/firmware/openos/bsp/boards/cc2538em/sens_itf/sens_itf_mote.c
static uint8_t sens_itf_mote_sm_func_pt_desc_ans(sens_itf_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 20;

    size = sens_itf_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size || (ans.hdr.addr != SENS_ITF_REGMAP_POINT_DESC_1 + st->point_index))
        return SENS_ITF_STATE_EXEC_ERROR;

    memcpy(&sensor_points.points[st->point_index].desc,&ans.payload.point_desc_cmd,sizeof(osens_point_desc_t));

    st->point_index++;
    sensor_points.num_of_points = st->point_index;

    return SENS_ITF_STATE_EXEC_OK;
}

static uint8_t sens_itf_mote_sm_func_req_pt_desc(sens_itf_mote_sm_state_t *st)
{
	// end of cyclic point description reading
	board_info.num_of_points = 1;  //teste rff

    if(st->point_index >= board_info.num_of_points)
    	return SENS_ITF_STATE_EXEC_WAIT_ABORT;

    cmd.hdr.addr = SENS_ITF_REGMAP_POINT_DESC_1 + st->point_index;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return sens_itf_mote_pack_send_frame(&cmd, 4);
}

static uint8_t sens_itf_mote_sm_func_proc_brd_id_ans(sens_itf_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 28;

    st->point_index = 0;

    size = sens_itf_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size)
    	return SENS_ITF_STATE_EXEC_ERROR;

    memcpy(&board_info, &ans.payload.brd_id_cmd, sizeof(osens_brd_id_t));

    if ((board_info.num_of_points == 0) || (board_info.num_of_points > OSENS_MAX_POINTS))
    	return SENS_ITF_STATE_EXEC_ERROR;

    sensor_points.num_of_points = 0;

    return SENS_ITF_STATE_EXEC_OK;
}

static uint8_t sens_itf_mote_sm_func_req_brd_id(sens_itf_mote_sm_state_t *st)
{
	cmd.hdr.size = 4;
	cmd.hdr.addr = SENS_ITF_REGMAP_BRD_ID;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return sens_itf_mote_pack_send_frame(&cmd, 4);
}


static uint8_t sens_itf_mote_sm_func_proc_itf_ver_ans(sens_itf_mote_sm_state_t *st)
{
    uint8_t size;
    uint8_t ans_size = 6;

    size = sens_itf_unpack_cmd_res(&ans, frame, ans_size);

	if (size != ans_size)
    	return SENS_ITF_STATE_EXEC_ERROR;

    if ((SENS_ITF_ANS_OK != ans.hdr.status) || (OSENS_LATEST_VERSION != ans.payload.itf_version_cmd.version))
    	return SENS_ITF_STATE_EXEC_ERROR;


    return SENS_ITF_STATE_EXEC_OK;
}


static uint8_t sens_itf_mote_sm_func_wait_ans(sens_itf_mote_sm_state_t *st)
{

	/* TODO!!!! MELHORAR O Tratamento do final de frame
	 * Devido ao problema da UART nao estar reconhecendo o final do frame
	 * a rotina esperar um ciclo de scan (250ms) entao se recebeu algum dado ele diz
	 * que recebeu o frame. Posteriormente sera tratado o frame e verificado se recebeu tudo
	 */
	if ((st->trmout_counter > 0) && (num_rx_bytes > 3))
	{
		st->frame_arrived = true;
		num_rx_bytes = 0;
	}

	if(st->frame_arrived)
	{
		st->frame_arrived = false;
		return SENS_ITF_STATE_EXEC_WAIT_STOP;
	}

	st->trmout_counter++;

	if(st->trmout_counter > st->trmout)
	{
		//se ocorreu timeout e existe bytes no buffer rx considero que recebeu msg
		if (num_rx_bytes > 0)
		{
			return SENS_ITF_STATE_EXEC_WAIT_STOP;
		}
		else
		{
			return SENS_ITF_STATE_EXEC_WAIT_ABORT;
		}
	}

	return SENS_ITF_STATE_EXEC_WAIT_OK;
}


static uint8_t sens_itf_mote_sm_func_req_ver(sens_itf_mote_sm_state_t *st)
{
    cmd.hdr.addr = SENS_ITF_REGMAP_ITF_VERSION;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(500);
    return sens_itf_mote_pack_send_frame(&cmd, 4);
}


static uint8_t sens_itf_mote_sm_func_init(sens_itf_mote_sm_state_t *st)
{
	uint8_t ret = SENS_ITF_STATE_EXEC_OK;

	memset(&cmd, 0, sizeof(cmd));
	memset(&ans, 0, sizeof(ans));
    memset(&sensor_points, 0, sizeof(sensor_points));
	memset(&board_info, 0, sizeof(board_info));
	memset(&acquisition_schedule, 0, sizeof(acquisition_schedule));
	memset(st, 0, sizeof(sens_itf_mote_sm_state_t));

	num_rx_bytes=0;


	return ret;
}

void sens_itf_mote_sm(void)
{
	uint8_t ret;

	#ifdef TRACE_ON
	uint8_t ls = sm_state.state;
	#endif

	ret = sens_itf_mote_sm_table[sm_state.state].func(&sm_state);

	if (flagErrorOccurred)
	{
      //reset uart
	  uart1_clearTxInterrupts();
	  uart1_clearRxInterrupts();      // clear possible pending interrupts
	  uart1_enableInterrupts();       // Enable USCI_A1 TX & RX interrupt

	  flagErrorOccurred = 0;
	}

	switch(ret)
	{
		case SENS_ITF_STATE_EXEC_OK:
		case SENS_ITF_STATE_EXEC_WAIT_STOP:
			sm_state.state = sens_itf_mote_sm_table[sm_state.state].next_state;
			break;
		case SENS_ITF_STATE_EXEC_WAIT_OK:
			// still waiting
			break;
		case SENS_ITF_STATE_EXEC_WAIT_ABORT:
			// wait timeout
			sm_state.state = sens_itf_mote_sm_table[sm_state.state].abort_state;
			break;
		case SENS_ITF_STATE_EXEC_ERROR:
		default:
			sm_state.state = sens_itf_mote_sm_table[sm_state.state].error_state;
			break;
	}

	#ifdef TRACE_ON
    printf("sens_itf_mote_sm %d -> %d\n",ls,sm_state.state);
	#endif

}

static void sens_itf_mote_tick(void)
{
    scheduler_push_task((task_cbt) sens_itf_mote_sm, TASKPRIO_SENS_ITF_MAIN);
}


const sens_itf_mote_sm_table_t sens_itf_mote_sm_table[] =
{     //{ func,                                   next_state,                      abort_state,                error_state         }
		{ sens_itf_mote_sm_func_init,             SENS_ITF_STATE_SEND_ITF_VER,     SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_INIT
		{ sens_itf_mote_sm_func_req_ver,          SENS_ITF_STATE_WAIT_ITF_VER_ANS, SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_SEND_ITF_VER
		{ sens_itf_mote_sm_func_wait_ans,         SENS_ITF_STATE_PROC_ITF_VER,     SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_WAIT_ITF_VER_ANS
		{ sens_itf_mote_sm_func_proc_itf_ver_ans, SENS_ITF_STATE_SEND_BRD_ID,      SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_PROC_ITF_VER
		{ sens_itf_mote_sm_func_req_brd_id,       SENS_ITF_STATE_WAIT_BRD_ID_ANS,  SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_SEND_BRD_ID
		{ sens_itf_mote_sm_func_wait_ans,         SENS_ITF_STATE_PROC_BRD_ID,      SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_WAIT_BRD_ID_ANS
		{ sens_itf_mote_sm_func_proc_brd_id_ans,  SENS_ITF_STATE_SEND_PT_DESC,     SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_PROC_BRD_ID
		{ sens_itf_mote_sm_func_req_pt_desc,      SENS_ITF_STATE_WAIT_PT_DESC_ANS, SENS_ITF_STATE_BUILD_SCH,   SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_SEND_PT_DESC
		{ sens_itf_mote_sm_func_wait_ans,         SENS_ITF_STATE_PROC_PT_DESC,     SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_WAIT_PT_DESC_ANS
		{ sens_itf_mote_sm_func_pt_desc_ans,      SENS_ITF_STATE_SEND_PT_DESC,     SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_PROC_PT_DESC
		{ sens_itf_mote_sm_func_build_sch,        SENS_ITF_STATE_RUN_SCH,          SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_BUILD_SCH
		{ sens_itf_mote_sm_func_run_sch,          SENS_ITF_STATE_RUN_SCH,          SENS_ITF_STATE_SEND_PT_VAL, SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_RUN_SCH
		{ sens_itf_mote_sm_func_req_pt_val,       SENS_ITF_STATE_WAIT_PT_VAL_ANS,  SENS_ITF_STATE_RUN_SCH,     SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_SEND_PT_VAL
		{ sens_itf_mote_sm_func_wait_ans,         SENS_ITF_STATE_PROC_PT_VAL,      SENS_ITF_STATE_SEND_PT_VAL, SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_WAIT_PT_VAL_ANS
		{ sens_itf_mote_sm_func_pt_val_ans,       SENS_ITF_STATE_SEND_PT_VAL,      SENS_ITF_STATE_INIT,        SENS_ITF_STATE_INIT }, // SENS_ITF_STATE_PROC_PT_VAL
};


/**************************************************************************//**
* @brief    This function puts up to \e size bytes into the BSP UART TX
*           buffer and starts to transfer data over UART.
*
*           If \b BSP_UART_ALL_OR_NOTHING is defined, data is put into the
*           TX buffer only if there is room for all \e size bytes.
*
* @param    frame            is a pointer to the source buffer.
* @param    size            is the number of bytes to transfer.
*
* @return   Returns the number of bytes actually copied to the TX buffer.
******************************************************************************/

